
#include	"iextreme.h"
#include	"GlobalFunction.h"
#include	"Collision.h"
#include	"Particle.h"

#include	"Knight_CPU.h"

//*********************************************************************************
//
//	Knight_CPUクラス
//
//*********************************************************************************

//-----------------------------------------------------------------------------
//	初期化・解放
//-----------------------------------------------------------------------------

	//	コンストラクタ
	Knight_CPU::Knight_CPU( void ) : Knight()
	{
		//	パラメータ初期化
		//lance_r = 0.0f;
		power = 5;
		speed = 0.2f;
		scale = 0.02f;
		isGround = true;
	}

	//	デストラクタ
	Knight_CPU::~Knight_CPU( void )
	{
	
	}

//-----------------------------------------------------------------------------
//	動作関数
//-----------------------------------------------------------------------------

	//	AI動作
	//void	Knight_CPU::ControlAI( void )
	//{
	//	particle->BlueFlame( GetPos(), 1.0f );
	//}