
#include	"iextreme.h"
#include	"GlobalFunction.h"
#include	"Collision.h"
#include	"Particle.h"

#include	"Princess_CPU.h"

//*********************************************************************************
//
//	Princess_CPUクラス
//
//*********************************************************************************

//-----------------------------------------------------------------------------
//	初期化・解放
//-----------------------------------------------------------------------------

	//	コンストラクタ
	Princess_CPU::Princess_CPU( void ) : Princess()
	{
		//	パラメータ初期化
		speed = 0.25f;
		scale = 0.02f;
		diffence = -1;
		isGround = true;
	}

	//	デストラクタ
	Princess_CPU::~Princess_CPU( void )
	{

	}

//-----------------------------------------------------------------------------
//	動作関数
//-----------------------------------------------------------------------------

	//	AI動作
	//void	Princess_CPU::ControlAI( void )
	//{
	//	particle->BlueFlame( GetPos(), 1.0f );
	//}