
#include	"iextreme.h"
#include	"GlobalFunction.h"
#include	"Collision.h"
#include	"Particle.h"

#include	"Squirrel_CPU.h"

//*********************************************************************************
//
//	Squirrel_CPUクラス
//
//*********************************************************************************

//-----------------------------------------------------------------------------
//	初期化・解放
//-----------------------------------------------------------------------------

	//	コンストラクタ
	Squirrel_CPU::Squirrel_CPU( void ) : Squirrel()
	{
		//	パラメータ初期化
		attackInfo.r = 0.0f;
		attackInfo.t = 0.0f;
		speed = 0.3f;
		scale = 0.02f;
		diffence = -5;
		isGround = true;
	}

	//	デストラクタ
	Squirrel_CPU::~Squirrel_CPU( void )
	{

	}

//-----------------------------------------------------------------------------
//	動作関数
//-----------------------------------------------------------------------------

	//	AI動作
	//void	Squirrel_CPU::ControlAI( void )
	//{
	//	particle->BlueFlame( GetPos(), 1.0f );
	//}