
#ifndef __Y2009_H__
#define	__Y2009_H__

//*******************************************************************************
//
//	Player_Y2009クラス
//
//*******************************************************************************

class Y2009	:	public	Player
{
private:
	//	定数
	enum Y2009Motion
	{
		STAND = 1,			//	立ち
		POSTURE,				//	構え
		RUN = 4,				//	走り
		ATTACK1,				//	攻撃１段階目
		ATTACK2,				//	攻撃２段階目
		ATTACK3,				//	攻撃３段階目
		JUMP,
		GUARD,
	};

public:
	//	初期化・解放
	Y2009( void );
	~Y2009( void );
	void	SetMotionNum( void );

	//	更新・描画

	//	動作関数

};

//*******************************************************************************
#endif // !__Y2009_H__
